# The Data Frame Structure

In [1]:
import pandas as pd

In [2]:
record1 = pd.Series({'Name':'Alice',
                    'Class':'Physics',
                    'Score':85})
record2 = pd.Series({'Name':'Jack',
                    'Class':'Chemistry',
                    'Score':82})
record3 = pd.Series({'Name':'Helen',
                    'Class':'Biology',
                    'Score':90})
df = pd.DataFrame([record1,record2,record3],index=['school1','school2','school3'])
df.head()

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school3  Helen    Biology     90

In [9]:
students = [{'Name':'Alice',
            'Class':'Physics',
            'Score':85},
           {'Name':'Jack',
           'Class':'Chemistry',
           'Score':82},
           {'Name':'Helen',
           'Class':'Biology',
           'Score':90}]
df = pd.DataFrame(students, index=['school1','school2','school3'])
df.head()

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school3  Helen    Biology     90

In [10]:
df.loc['school2']

Name          Jack
Class    Chemistry
Score           82
Name: school2, dtype: object

In [11]:
type(df.loc['school2'])

pandas.core.series.Series

In [12]:
df.loc['school1','Name']

'Alice'

In [13]:
df.T

       school1    school2  school3
Name     Alice       Jack    Helen
Class  Physics  Chemistry  Biology
Score       85         82       90

In [14]:
df.T.loc['Name']

school1    Alice
school2     Jack
school3    Helen
Name: Name, dtype: object

In [15]:
df['Name']

school1    Alice
school2     Jack
school3    Helen
Name: Name, dtype: object

In [16]:
type(df['Name'])

pandas.core.series.Series

In [17]:
df.loc['school1']['Name']

'Alice'

In [18]:
print(type(df.loc['school1'])) #should be a Data frame
print(type(df.loc['school1']['Name'])) #should be series

<class 'pandas.core.series.Series'>
<class 'str'>

In [19]:
df.loc[:,['Name','Score']]

          Name  Score
school1  Alice     85
school2   Jack     82
school3  Helen     90

In [21]:
df.drop('school1')

          Name      Class  Score
school2   Jack  Chemistry     82
school3  Helen    Biology     90

In [22]:
df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school3  Helen    Biology     90

In [23]:
copy_df = df.copy()

In [24]:
copy_df.drop("Name",inplace=True,axis=1)
copy_df

             Class  Score
school1    Physics     85
school2  Chemistry     82
school3    Biology     90

In [30]:
df['ClassRanking'] = None
df

          Name      Class  Score ClassRanking
school1  Alice    Physics     85         None
school2   Jack  Chemistry     82         None
school3  Helen    Biology     90         None

# Data Frame Indexing and loading

In [36]:
df = pd.read_csv('Iris.csv')
df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [37]:
df = pd.read_csv('Iris.csv',index_col=0)
df.head()

    SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
Id
1             5.1           3.5            1.4           0.2  Iris-setosa
2             4.9           3.0            1.4           0.2  Iris-setosa
3             4.7           3.2            1.3           0.2  Iris-setosa
4             4.6           3.1            1.5           0.2  Iris-setosa
5             5.0           3.6            1.4           0.2  Iris-setosa

In [39]:
df.columns

Index(['SepalLengthCm', 'SepalWidthCm', 'PetalLengthCm', 'PetalWidthCm',
       'Species'],
      dtype='object')

In [47]:
new_df=new_df.rename(mapper=str.strip, axis='columns')
new_df.head()

NameError: name 'new_df' is not defined

In [48]:
cols = list(df.columns)
cols = [x.lower().strip() for x in cols]
df.columns=cols
df.head()

    sepallengthcm  sepalwidthcm  petallengthcm  petalwidthcm      species
Id
1             5.1           3.5            1.4           0.2  Iris-setosa
2             4.9           3.0            1.4           0.2  Iris-setosa
3             4.7           3.2            1.3           0.2  Iris-setosa
4             4.6           3.1            1.5           0.2  Iris-setosa
5             5.0           3.6            1.4           0.2  Iris-setosa